; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_57)

(:domain logistics)

(:objects
	obj0 obj3 obj6 - airport
	obj1 obj4 obj7 - city
	obj2 obj5 obj8 - truck
	obj9 obj11 obj15 obj16 obj18 obj20 obj21 obj22 - package
	obj10 obj12 obj13 obj17 - location
	obj14 obj19 - airplane
)

(:init
	(at obj2 obj0)
	(at obj5 obj3)
	(at obj8 obj6)
	(at obj9 obj6)
	(at obj11 obj3)
	(at obj14 obj0)
	(at obj15 obj3)
	(at obj16 obj3)
	(at obj18 obj6)
	(at obj19 obj0)
	(at obj20 obj3)
	(at obj21 obj0)
	(at obj22 obj6)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj6 obj7)
	(in-city obj10 obj7)
	(in-city obj12 obj1)
	(in-city obj13 obj4)
	(in-city obj17 obj1)
)

(:goal (and
	(at obj9 obj13)
	(at obj11 obj10)
	(at obj15 obj12)
	(at obj16 obj17)
	(at obj18 obj13)
	(at obj20 obj10)
	(at obj21 obj10)
	(at obj22 obj13)
))
)

; plan
1. (drive obj2 obj0 obj12)
   deleted: (at obj2 obj0)
   added: (at obj2 obj12)
   goals met: 0 of 8
2. (drive obj5 obj3 obj13)
   deleted: (at obj5 obj3)
   added: (at obj5 obj13)
   goals met: 0 of 8
3. (drive obj8 obj6 obj10)
   deleted: (at obj8 obj6)
   added: (at obj8 obj10)
   goals met: 0 of 8
4. (fly obj14 obj0 obj6)
   deleted: (at obj14 obj0)
   added: (at obj14 obj6)
   goals met: 0 of 8
5. (load obj19 obj21 obj0)
   deleted: (at obj21 obj0)
   added: (in obj21 obj19)
   goals met: 0 of 8
6. (fly obj19 obj0 obj3)
   deleted: (at obj19 obj0)
   added: (at obj19 obj3)
   goals met: 0 of 8
7. (drive obj5 obj13 obj3)
   deleted: (at obj5 obj13)
   added: (at obj5 obj3)
   goals met: 0 of 8
8. (drive obj8 obj10 obj6)
   deleted: (at obj8 obj10)
   added: (at obj8 obj6)
   goals met: 0 of 8
9. (load obj14 obj18 obj6)
   deleted: (at obj18 obj6)
   added: (in obj18 obj14)
   goals met: 0 of 8
10. (load obj14 obj22 obj6)
   deleted: (at obj22 obj6)
   added: (in obj22 obj14)
   goals met: 0 of 8
11. (load obj14 obj9 obj6)
   deleted: (at obj9 obj6)
   added: (in obj9 obj14)
   goals met: 0 of 8
12. (load obj19 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj19)
   goals met: 0 of 8
13. (load obj19 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj19)
   goals met: 0 of 8
14. (load obj19 obj16 obj3)
   deleted: (at obj16 obj3)
   added: (in obj16 obj19)
   goals met: 0 of 8
15. (load obj19 obj20 obj3)
   deleted: (at obj20 obj3)
   added: (in obj20 obj19)
   goals met: 0 of 8
16. (fly obj14 obj6 obj0)
   deleted: (at obj14 obj6)
   added: (at obj14 obj0)
   goals met: 0 of 8
17. (fly obj19 obj3 obj0)
   deleted: (at obj19 obj3)
   added: (at obj19 obj0)
   goals met: 0 of 8
18. (drive obj2 obj12 obj0)
   deleted: (at obj2 obj12)
   added: (at obj2 obj0)
   goals met: 0 of 8
19. (drive obj8 obj6 obj10)
   deleted: (at obj8 obj6)
   added: (at obj8 obj10)
   goals met: 0 of 8
20. (fly obj19 obj0 obj6)
   deleted: (at obj19 obj0)
   added: (at obj19 obj6)
   goals met: 0 of 8
21. (drive obj2 obj0 obj12)
   deleted: (at obj2 obj0)
   added: (at obj2 obj12)
   goals met: 0 of 8
22. (drive obj5 obj3 obj13)
   deleted: (at obj5 obj3)
   added: (at obj5 obj13)
   goals met: 0 of 8
23. (fly obj19 obj6 obj3)
   deleted: (at obj19 obj6)
   added: (at obj19 obj3)
   goals met: 0 of 8
24. (drive obj2 obj12 obj0)
   deleted: (at obj2 obj12)
   added: (at obj2 obj0)
   goals met: 0 of 8
25. (drive obj5 obj13 obj3)
   deleted: (at obj5 obj13)
   added: (at obj5 obj3)
   goals met: 0 of 8
26. (drive obj8 obj10 obj6)
   deleted: (at obj8 obj10)
   added: (at obj8 obj6)
   goals met: 0 of 8
27. (fly obj14 obj0 obj3)
   deleted: (at obj14 obj0)
   added: (at obj14 obj3)
   goals met: 0 of 8
28. (drive obj2 obj0 obj17)
   deleted: (at obj2 obj0)
   added: (at obj2 obj17)
   goals met: 0 of 8
29. (drive obj5 obj3 obj13)
   deleted: (at obj5 obj3)
   added: (at obj5 obj13)
   goals met: 0 of 8
30. (drive obj8 obj6 obj10)
   deleted: (at obj8 obj6)
   added: (at obj8 obj10)
   goals met: 0 of 8
31. (fly obj14 obj3 obj0)
   deleted: (at obj14 obj3)
   added: (at obj14 obj0)
   goals met: 0 of 8
32. (fly obj19 obj3 obj0)
   deleted: (at obj19 obj3)
   added: (at obj19 obj0)
   goals met: 0 of 8
33. (drive obj2 obj17 obj0)
   deleted: (at obj2 obj17)
   added: (at obj2 obj0)
   goals met: 0 of 8
34. (drive obj8 obj10 obj6)
   deleted: (at obj8 obj10)
   added: (at obj8 obj6)
   goals met: 0 of 8
35. (fly obj14 obj0 obj3)
   deleted: (at obj14 obj0)
   added: (at obj14 obj3)
   goals met: 0 of 8
36. (unload obj19 obj15 obj0)
   deleted: (in obj15 obj19)
   added: (at obj15 obj0)
   goals met: 0 of 8
37. (unload obj19 obj16 obj0)
   deleted: (in obj16 obj19)
   added: (at obj16 obj0)
   goals met: 0 of 8
38. (fly obj19 obj0 obj6)
   deleted: (at obj19 obj0)
   added: (at obj19 obj6)
   goals met: 0 of 8
39. (drive obj5 obj13 obj3)
   deleted: (at obj5 obj13)
   added: (at obj5 obj3)
   goals met: 0 of 8
40. (load obj2 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj2)
   goals met: 0 of 8
41. (load obj2 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj2)
   goals met: 0 of 8
42. (unload obj14 obj18 obj3)
   deleted: (in obj18 obj14)
   added: (at obj18 obj3)
   goals met: 0 of 8
43. (unload obj14 obj22 obj3)
   deleted: (in obj22 obj14)
   added: (at obj22 obj3)
   goals met: 0 of 8
44. (unload obj14 obj9 obj3)
   deleted: (in obj9 obj14)
   added: (at obj9 obj3)
   goals met: 0 of 8
45. (unload obj19 obj11 obj6)
   deleted: (in obj11 obj19)
   added: (at obj11 obj6)
   goals met: 0 of 8
46. (unload obj19 obj20 obj6)
   deleted: (in obj20 obj19)
   added: (at obj20 obj6)
   goals met: 0 of 8
47. (unload obj19 obj21 obj6)
   deleted: (in obj21 obj19)
   added: (at obj21 obj6)
   goals met: 0 of 8
48. (drive obj2 obj0 obj17)
   deleted: (at obj2 obj0)
   added: (at obj2 obj17)
   goals met: 0 of 8
49. (fly obj14 obj3 obj6)
   deleted: (at obj14 obj3)
   added: (at obj14 obj6)
   goals met: 0 of 8
50. (fly obj19 obj6 obj3)
   deleted: (at obj19 obj6)
   added: (at obj19 obj3)
   goals met: 0 of 8
51. (fly obj14 obj6 obj0)
   deleted: (at obj14 obj6)
   added: (at obj14 obj0)
   goals met: 0 of 8
52. (fly obj19 obj3 obj6)
   deleted: (at obj19 obj3)
   added: (at obj19 obj6)
   goals met: 0 of 8
53. (load obj5 obj18 obj3)
   deleted: (at obj18 obj3)
   added: (in obj18 obj5)
   goals met: 0 of 8
54. (load obj5 obj22 obj3)
   deleted: (at obj22 obj3)
   added: (in obj22 obj5)
   goals met: 0 of 8
55. (load obj5 obj9 obj3)
   deleted: (at obj9 obj3)
   added: (in obj9 obj5)
   goals met: 0 of 8
56. (load obj8 obj11 obj6)
   deleted: (at obj11 obj6)
   added: (in obj11 obj8)
   goals met: 0 of 8
57. (load obj8 obj20 obj6)
   deleted: (at obj20 obj6)
   added: (in obj20 obj8)
   goals met: 0 of 8
58. (load obj8 obj21 obj6)
   deleted: (at obj21 obj6)
   added: (in obj21 obj8)
   goals met: 0 of 8
59. (unload obj2 obj16 obj17)
   deleted: (in obj16 obj2)
   added: (at obj16 obj17)
   goals met: 1 of 8
60. (drive obj2 obj17 obj12)
   deleted: (at obj2 obj17)
   added: (at obj2 obj12)
   goals met: 1 of 8
61. (drive obj5 obj3 obj13)
   deleted: (at obj5 obj3)
   added: (at obj5 obj13)
   goals met: 1 of 8
62. (drive obj8 obj6 obj10)
   deleted: (at obj8 obj6)
   added: (at obj8 obj10)
   goals met: 1 of 8
63. (fly obj19 obj6 obj3)
   deleted: (at obj19 obj6)
   added: (at obj19 obj3)
   goals met: 1 of 8
64. (unload obj2 obj15 obj12)
   deleted: (in obj15 obj2)
   added: (at obj15 obj12)
   goals met: 2 of 8
65. (unload obj5 obj18 obj13)
   deleted: (in obj18 obj5)
   added: (at obj18 obj13)
   goals met: 3 of 8
66. (unload obj5 obj22 obj13)
   deleted: (in obj22 obj5)
   added: (at obj22 obj13)
   goals met: 4 of 8
67. (unload obj5 obj9 obj13)
   deleted: (in obj9 obj5)
   added: (at obj9 obj13)
   goals met: 5 of 8
68. (unload obj8 obj11 obj10)
   deleted: (in obj11 obj8)
   added: (at obj11 obj10)
   goals met: 6 of 8
69. (unload obj8 obj20 obj10)
   deleted: (in obj20 obj8)
   added: (at obj20 obj10)
   goals met: 7 of 8
70. (unload obj8 obj21 obj10)
   deleted: (in obj21 obj8)
   added: (at obj21 obj10)
   goals met: 8 of 8
